Repository: 84000/data-translation-memory
Catalog: toh1-1-v1.tmx
Source language: bo
Languages: en

source: བདག་ནི་ཁ་ཅིག་བཟོད་ལ་ཁ་ཅིག་མི་བཟོད་དོ་ཞེས་དེ་ལྟར་ལྟ་ཞིང་དེ་སྐད་སྨྲ་བ་གང་ཡིན་པ་གཉིས་དང་བདག་ལྷན་ཅིག་རྩོད་པར་འགྱུར།
en: and the view and argument that some selves endure while other selves do not endure would counter and undermine the self;

source: འགྱེད་པར་འགྱུར་ཏེ། རྩོད་ན་འགྱེད་པར་འགྱུར། འགྱེད་ན་རྣམ་པར་འཚེ་བར་འགྱུར་རོ། །
en: if it counters, it would undermine, and if it undermines, it would debunk the self.

source: དེ་ལྟར་རྩོད་པ་དང་། འགྱེད་པ་དང་། རྣམ་པར་འཚེ་བ་ཡང་དག་པར་མཐོང་ནས་
en: “In correctly seeing the countering, the undermining, and the debunking thus done,

source: ལྟ་བ་འདིའང་དོར་ཞིང་ལྟ་བ་གཞན་ཉེ་བར་མི་བླང་སྟེ།
en: that view too would be abandoned and other views would not be embraced.

source: དེ་ལྟར་ན་བདག་ལ་ལྟ་བ་དེ་ཡང་སྤོང་བ་དང་། འདོར་བ་དང་། མེད་པར་འགྱུར་ལ།
en: Thus that view of self too would be abandoned, discarded, and cease to be,

source: ལྟ་བ་གཞན་ཡང་མཚམས་མི་སྦྱོར་བ་དང་། ཉེ་བར་མི་ལེན་པ་དང་། མི་འབྱུང་བར་འགྱུར་རོ་སྙམ་མོ། །
en: while other views too would not be entertained, embraced, or arise.

source: གལ་ཏེ་བདག་ཐམས་ཅད་མི་བཟོད་དོ་ཞེས་དེ་ལྟར་ལྟ་ཞིང་དེ་སྐད་སྨྲ་ན་
en: if one holds the view and argues that no self endures, then the view and argument that all selves endure

source: དེ་ལ་འཕགས་པ་ཉན་ཐོས་ཐོས་པ་དང་ལྡན་པ་ནི་འདི་ལྟར་སོ་སོར་རྟོག་པར་བྱེད་དེ་གལ་ཏེ་
en: “Informed noble disciples scrutinize the third position in this way:

source: བདག་ཁ་ཅིག་བཟོད་ལ་ཁ་ཅིག་མི་བཟོད་དོ་ཞེས་དེ་ལྟར་ལྟ་ཞིང་དེ་སྐད་སྨྲ་ན་བདག་ནི་ཐམས་ཅད་བཟོད་དོ་ཞེས་དེ་ལྟར་ལྟ་ཞིང་དེ་སྐད་སྨྲ་བ་གང་ཡིན་པ་དང་།
en: if one holds the view and argues that some selves endure while other selves do not endure,

source: མེར་འཇུག་གི་བུ་ལུས་འདི་ནི་གཟུགས་ཅན་རགས་པ་འབྱུང་བ་ཆེན་པོ་བཞི་ལས་གྱུར་པ་ཡིན་ཏེ།
en: “Son of a self-immolator, as this body is composed of gross form and arises from the four great elements,

source: དེ་ལ་འཕགས་པའི་ཉན་ཐོས་ཀྱིས་ཡང་དང་ཡང་དུ་འབྱུང་བ་དང་འཇིག་པ་རྗེས་སུ་བལྟ་ཞིང་གནས་པར་བྱའོ། །
en: noble disciples observe and dwell on its repeated arising and destruction.

source: དེ་ལ་འཕགས་པའི་ཉན་ཐོས་ཡང་དང་ཡང་དུ་འབྱུང་བ་དང་འཇིག་པར་རྗེས་སུ་ལྟ་ཞིང་གནས་ན།
en: If noble disciples observe and dwell on its repeated arising and destruction,

source: དེ་ལ་ལུས་ལ་འདུན་པ་དང་། ལུས་ལ་ཆགས་པ་དང་། ལུས་ལ་དགའ་བ་དང་། ལུས་ལ་ཞེན་པ་དང་།
en: whatever aspirations, attachment, craving, obsessions,

source: ལུས་ལ་ཆུམས་པ་དང་། ལུས་ལ་ལྷག་པར་ཆགས་པ་འབྱུང་བ་གང་ཡིན་པ་དེས་དེའི་སེམས་ཡོངས་སུ་གཏུགས་ཏེ་མི་གནས་སོ། །
en: preoccupations, or excessive attachment may arise towards the body will be confronted and will not remain.

source: མེར་འཇུག་གི་བུ་གསུམ་པོ་འདི་དག་ནི་ཚོར་བ་ཡིན་ཏེ། གསུམ་གང་ཞེ་ན།
en: “Son of a self-immolator, there are three feelings. What are these three?

source: བདེ་བ་དང་། སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཡང་མ་ཡིན་བདེ་བ་ཡང་མ་ཡིན་པའོ། །
en: Pleasure, pain, and that which is neither pleasant nor painful.

source: མེར་འཇུག་གི་བུ་གང་གི་ཚེ་འཕགས་པའི་ཉན་ཐོས་བདེ་བའི་ཚོར་བ་མྱོང་བར་བྱེད་པ་དེའི་ཚེ་ན་
en: Son of a self-immolator, when noble disciples experience feelings of pleasure,

source: དེ་ལ་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཡང་མ་ཡིན་བདེ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་གཉིས་འགག་པར་འགྱུར་ཏེ།
en: then feelings of pain and feelings which are neither pleasant nor painful come to a halt.

source: དེའི་ཚེ་ན་འཕགས་པའི་ཉན་ཐོས་བདེ་བའི་ཚོར་བ་འབའ་ཞིག་མྱོང་བར་བྱེད་དེ།
en: At that time noble disciples experience only feelings of pleasure

source: བདེ་བའི་ཚོར་བ་ཡང་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། འགོག་པའི་ཆོས་ཅན་ཡིན་ནོ། །
en: yet feelings of pleasure too are subject to impermanence, suffering, and cessation.

source: གང་གི་ཚེ་འཕགས་པའི་ཉན་ཐོས་སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་བར་བྱེད་པ་དེའི་ཚེ་ན་
en: “When noble disciples experience feelings of pain,

source: དེ་ལ་བདེ་བ་དང་། སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་བདེ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་གཉིས་འགག་པར་འགྱུར་ཏེ།
en: then feelings of pleasure and feelings which are neither pleasant nor painful come to a halt.

source: དེའི་ཚེ་ན་འཕགས་པའི་ཉན་ཐོས་སྡུག་བསྔལ་གྱི་ཚོར་བ་འབའ་ཞིག་མྱོང་བར་བྱེད་དེ།
en: At that time, noble disciples experience only feelings of pain

source: སྡུག་བསྔལ་གྱི་ཚོར་བ་ཡང་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། འགོག་པའི་ཆོས་ཅན་ཡིན་ནོ། །
en: yet feelings of pain too are subject to impermanence, suffering, and cessation.

source: གང་གི་ཚེ་འཕགས་པའི་ཉན་ཐོས་སྡུག་བསྔལ་ཡང་མ་ཡིན་བདེ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་མྱོང་བར་བྱེད་པ་དེའི་ཚེ་ན་དེ་ལ་བདེ་བ་དང་སྡུག་བསྔལ་གྱི་ཚོར་བ་གཉིས་འགག་པར་འགྱུར་ཏེ།
en: “When noble disciples experience feelings which are neither pleasant nor painful, then feelings of pleasure and pain come to a halt.

source: དེའི་ཚེ་ན་འཕགས་པའི་ཉན་ཐོས་སྡུག་བསྔལ་ཡང་མ་ཡིན་བདེ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་འབའ་ཞིག་མྱོང་བར་བྱེད་དེ།
en: At that time, noble disciples experience only feelings that are neither pleasant nor painful

source: སྡུག་བསྔལ་ཡང་མ་ཡིན་བདེ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་ཡང་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། འགོག་པའི་ཆོས་ཅན་ནོ། །
en: yet feelings that are neither pleasant nor painful too are subject to impermanence, suffering, and cessation.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ་ཚོར་བ་འདི་དག་གི་གཞི་ནི་གང་ཡིན།
en: “Thus they think, ‘What is the basis for these feelings?

source: ཀུན་འབྱུང་བ་ནི་གང་ཡིན། རིགས་མཐུན་པ་ནི་གང་ཡིན།
en: What are their origins? What types of things are compatible with them?

source: རབ་ཏུ་སྐྱེད་པ་ནི་གང་ཡིན་སྙམ་ན།
en: What has produced their arising?’

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཚོར་བ་འདི་དག་གི་གཞི་ནི་རེག་པ་ཡིན།
en: On reflection, the basis for these feelings is contact,

source: ཀུན་འབྱུང་བ་ནི་རེག་པ་ཡིན། རིགས་མཐུན་པ་ནི་རེག་པ་ཡིན། རབ་ཏུ་སྐྱེད་པ་ནི་རེག་པ་ཡིན་ཏེ།
en: their origins lie in contact, they are compatible with contact, what has produced them is contact.

source: རེག་པ་དེ་དང་དེ་ཀུན་འབྱུང་བ་ལས་ཚོར་བ་དེ་དང་དེ་དག་ཀུན་འབྱུང་ངོ་། །
en: Thus contact of different types occurs, prompting feelings of different types to arise.

source: རེག་པ་དེ་དང་དེ་འགགས་པ་ལས་ཚོར་བ་དེ་དང་དེ་དག་འགག་པར་འགྱུར།
en: Contact of different types cease, prompting feelings of different types to cease,

source: ཉེ་བར་ཞི་བར་འགྱུར། བསིལ་བར་འགྱུར། ནུབ་པར་འགྱུར་རོ་སྙམ་མོ། །
en: to calm, to cool off, to fade away.

source: དེ་བདེ་བའམ། སྡུག་བསྔལ་བའམ། སྡུག་བསྔལ་ཡང་མ་ཡིན་བདེ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་གང་ཡང་
en: Thus when they experience feelings that are pleasant, painful or neither pleasant nor painful,

source: རུང་བ་མྱོང་བར་བྱེད་པ་ན་དེས་དེ་དག་གི་ཀུན་འབྱུང་བ་དང་། ནུབ་པ་དང་། རོ་མྱང་བ་དང་། ཉེས་དམིགས་དང་། ངེས་པར་འབྱུང་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་སོ།
en: they thoroughly and precisely understand their origins, their fading, their flavor, their shortcomings, and their perfect renunciation.

source: དེ་ཚོར་བ་དེ་དག་གི་ཀུན་འབྱུང་བ་དང་། ནུབ་པ་དང་། རོ་མྱང་བ་དང་། ཉེས་དམིགས་དང་། ངེས་པར་འབྱུང་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་ན་
en: “When they thoroughly and precisely understand their origins, their fading, their flavor, their shortcomings, and their perfect renunciation,

source: ཚོར་བ་བྱུང་ངོ་ཅོག་ལ་མི་རྟག་པར་རྗེས་སུ་ལྟ་ཞིང་གནས། །
en: they view and rest in the impermanence of any feeling that arises,

source: ཟད་པར་རྗེས་སུ་ལྟ་བ་དང་། འཇིག་པར་རྗེས་སུ་ལྟ་བ་དང་།
en: they view its dwindling, they view its disintegration

source: འདོད་ཆགས་དང་བྲལ་བར་རྗེས་སུ་ལྟ་བ་དང་། འགོག་པར་རྗེས་སུ་ལྟ་བ་དང་། རབ་ཏུ་སྤོང་བར་རྗེས་སུ་ལྟ་ཞིང་གནས་སོ།
en: they view it free of desirous attachment, they view its cessation, and view and rest in its utter abandonment.

source: དེ་ཚོར་བ་བྱུང་ངོ་ཅོག་ལ་མི་རྟག་པར་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་དང་། ཟད་པར་རྗེས་སུ་ལྟ་བ་དང་། འཇིག་པར་རྗེས་སུ་ལྟ་བ་དང་།
en: “When they view and rest in the impermanence of any feeling that arises while viewing its dwindling, viewing its disintegration

source: འདོད་ཆགས་དང་བྲལ་བར་རྗེས་སུ་ལྟ་བ་དང་། འགོག་པར་རྗེས་སུ་ལྟ་བ་དང་། །
en: viewing it free of desirous attachment, viewing its cessation,

source: རབ་ཏུ་སྤོང་བར་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་ན་འཇིག་རྟེན་ལ་ཅུང་ཟད་ཀྱང་ཉེ་བར་ལེན་པར་མི་བྱེད་དོ།
en: and viewing and resting in its utter abandonment, they are not taken in, even in the slightest, by the world.

source: ཉེ་བར་ལེན་པར་མི་བྱེད་ན་ཡོངས་སུ་གདུང་བར་མི་འགྱུར་རོ། །
en: If they are not taken in, there will be no torment.

source: ཡོངས་སུ་མི་གདུང་ན་བདག་གི་སྐྱེ་བ་ཟད་དོ། །
en: If there is no torment, they will understand that their births have come to an end,

source: ཚངས་པར་སྤྱོད་པ་བསྟེན་ཏོ། །བྱ་བ་བྱས་སོ། །
en: that they have lived the holy life, that they have done what needed doing,

source: སྲིད་པ་འདི་ལས་གཞན་མི་ཤེས་སོ་ཞེས
en: and that they will know no lives after this one.

source: སྲིད་པ་འདི་ལས་གཞན་མི་ཤེས་སོ་ཞེས་གོ་བར་བྱེད་ཅིང་བདག་ཉིད་ཁོ་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱེད་དོ། །
en: and that they will know no lives after this one. Thus they themselves will altogether transcend misery.

source: དེ་ལུས་ཀྱི་མཐའ་པའི་ཚོར་བ་མྱོང་བར་བྱེད་པ་ན་
en: When they experience the body’s most basic feelings,

source: ལུས་ཀྱི་མཐའ་པའི་ཚོར་བ་མྱོང་ངོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་སོ། །
en: they thoroughly and precisely understand them with the thought, ‘I am experiencing the body’s most basic feelings.’

source: སྲོག་གི་མཐའ་པའི་ཚོར་བ་མྱོང་བར་བྱེད་པ་ན་
en: When they experience the life-force’s most basic feeling,

source: སྲོག་གི་མཐའ་པའི་ཚོར་བ་མྱོང་ངོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་སོ། །
en: they thoroughly and precisely understand it with the thought, ‘I am experiencing the life-force’s most basic feeling.’

source: ལུས་ཞིག་པའི་འོག་ཏུ་སྲོག་ཡོངས་སུ་གཏུགས་པས་
en: “Since the life-force comes to an end after the body has perished,

source: འདི་ཉིད་དུ་དེའི་ཚོར་བ་ཐམས་ཅད་མ་ལུས་པར་འགག་པར་འགྱུར།
en: all of that life’s feelings, every last one of them, come to a halt,

source: མ་ལུས་པར་ནུབ་པར་འགྱུར། མ་ལུས་པར་ཟད་པར་འགྱུར།
en: every last one of them fades away, every last one of them dwindles away,

source: མ་ལུས་པར་ཡོངས་སུ་གཏུགས་པར་འགྱུར་རོ། །
en: and every last one of them comes to an end.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་བདེ་བའི་ཚོར་བ་མྱོང་བར་བྱེད་པ་ན་ལུས་ཞིག་པར་གྱུར་ན་དེ་ཉིད་སྡུག་བསྔལ་གྱི་མཐའ་ཡིན་ནོ། །
en: Thus they think, ‘When I experience feelings of pleasure, if the body should perish, that will be the end of suffering.

source: བདག་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཡང་མ་ཡིན་བདེ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་མྱོང་བར་བྱེད་པ་ན་
en: When I experience feelings of pain and feelings that are neither pleasant nor painful,

source: ལུས་ཞིག་པར་གྱུར་ན་དེ་ཉིད་སྡུག་བསྔལ་གྱི་མཐའ་ཡིན་ནོ་སྙམ་མོ། །
en: if the body should perish, that will be the end of suffering.’

source: དེ་བདེ་བའི་ཚོར་བ་མྱོང་བར་བྱེད་པ་ན་མི་ལྡན་པ་མྱོང་བར་བྱེད་ཀྱི་ལྡན་པ་ནི་མ་ཡིན་ནོ། །
en: “Thus when they experience the feeling of pleasure, it is unaccompanied, it is not accompanied by experiences.

source: དེ་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཡང་མ་ཡིན་བདེ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་མྱོང་བར་བྱེད་པ་ན་མི་ལྡན་པ་མྱོང་བར་བྱེད་ཀྱི་ལྡན་པ་ནི་མ་ཡིན་ནོ། །
en: When they experience the feeling of pain or a feeling that is neither pleasant nor painful, it is unaccompanied, it is not accompanied by experiences.

source: ཇི་ཞིག་དང་མི་ལྡན་ཞེ་ན། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་
en: “What does not accompany their death? It is not accompanied by desire, aversion, or confusion.

source: མི་ལྡན་པ་དང་། སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་།
en: It is not accompanied by birth, aging, illness, death, mourning, cries of misery,

source: སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་དག་དང་མི་ལྡན་པ་དང་།
en: pain, unease, or disturbance.

source: སྡུག་བསྔལ་དང་མི་ལྡན་པ་ཪང་སྨྲའོ། །
en: It is not, I argue, accompanied by suffering.”

source: དེའི་ཚེ་ན་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་བསྙེན་པར་རྫོགས་ནས་ཟླ་བ་ཕྱེད་ལོན་པ།
en: During this talk, the venerable Śāriputra, who had been ordained two weeks earlier,

source: བཅོམ་ལྡན་འདས་ཀྱི་སྣམ་ལོགས་ན་བསིལ་ཡབ་ཐོགས་ཏེ་བཅོམ་ལྡན་འདས་ལ་གཡོབ་ཅིང་འདུག་གོ། །
en: sat, fanning the Blessed One.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Śāriputra then had this thought:

source: བཅོམ་ལྡན་འདས་ཆོས་དེ་དང་དེ་དག་གི་སྤོང་བ་ཉིད་ཀྱི་བསྔགས་པ་བརྗོད་པ་མཛད་ཅིང་འདོད་ཆགས་དང་བྲལ་བ་ཉིད་དང་། འགོག་པ་ཉིད་དང་། རབ་ཏུ་སྤོང་བ་ཉིད་ཀྱི་བསྔགས་པ་བརྗོད་པར་མཛད་ཀྱིས།
en: “The Blessed One has praised the abandonment of such phenomena along with the freedom from, the cessation of, and the utter abandonment of desire.

source: བདག་གིས་ཀྱང་ཆོས་དེ་དང་དེ་དག་ལ་སྤོང་བ་རྗེས་སུ་ལྟ་ཞིང་གནས་པར་བྱ།
en: I, too, should observe and abide by the abandonment of such phenomena,

source: དོད་ཆགས་དང་བྲལ་བར་རྗེས་སུ་ལྟ་བ་དང་། །
en: and should observe freedom from desire.

source: བདག་གིས་ཀྱང་ཆོས་དེ་དང་དེ་དག་ལ་སྤོང་བ་རྗེས་སུ་ལྟ་ཞིང་གནས་པར་བྱ། འདོད་ཆགས་དང་བྲལ་བར་རྗེས་སུ་ལྟ་བ་དང་།
en: I, too, should observe and abide by the abandonment of such phenomena, and should observe freedom from desire.

source: འགོག་པར་རྗེས་སུ་ལྟ་བ་དང་། རབ་ཏུ་སྤོང་བར་རྗེས་སུ་ལྟ་ཞིང་གནས་པར་བྱའོ་སྙམ་མོ།
en: I, too, should observe and abide by the abandonment of such phenomena, and its cessation. I, too, should observe and abide by its utter abandonment.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཆོས་དེ་དང་དེ་དག་ལ་སྤོང་བར་རྗེས་སུ་ལྟ་ཞིང་གནས།
en: Śāriputra then observed and abided by the abandonment of such phenomena.

source: འདོད་ཆགས་དང་བྲལ་བར་རྗེས་སུ་ལྟ་བ་དང་། འགོག་པར་རྗེས་སུ་ལྟ་བ་དང་། རབ་ཏུ་སྤོང་བར་རྗེས་སུ་ལྟ་ཞིང་གནས་སོ། །
en: He proceeded to observe freedom from desire, observe its cessation, and observe and abide by its utter abandonment.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཆོས་དེ་དང་དེ་དག་ལ་སྤོང་བར་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་དང་། འདོད་ཆགས་དང་བྲལ་བར་རྗེས་སུ་ལྟ་བ་དང་། འགོག་པར་རྗེས་སུ་ལྟ་བ་དང་།
en: As he observed and abided by the abandonment of such phenomena and proceeded to observe freedom from desire, observe its cessation,

source: རབ་ཏུ་སྤོང་བར་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་ན་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: and observe and abide by its utter abandonment, his mind, in the absence of grasping, was freed from defilements.

source: ཀུན་དུ་རྒྱུ་སེན་རིངས་ཀྱང་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་སོ།
en: The wanderer Dīrghanakha, too, came to see phenomena through the unclouded and pristine eyes of Dharma.

source: དེ་ནས་ཀུན་དུ་རྒྱུ་སེན་རིངས་ཆོས་མཐོང་བ་དང་། །
en: Dīrghanakha saw the Dharma,

source: ཆོས་ཐོས་པ་དང་། ཆོས་རིག་པ་དང་། ཆོས་ཀྱི་གཏིང་སླེབ་པ་དང་།
en: heard the Dharma, knew the Dharma, plumbed the depths of the Dharma,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་
en: pulled his shawl from one shoulder, bowed to the Blessed One with his palms pressed together,

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: and made the following request to the Blessed One:

source: བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་གནང་ན།
en: “If it is permitted, reverend, I would obtain the going forth, ordination, and monkhood in the well-proclaimed Dharma and Vinaya.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བདག་ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་བགྱིའོ། །
en: I would live the holy life in the Blessed One’s presence.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བས་རབ་ཏུ་ཕྱུང་ཞིང་
en: The Blessed One said to him, “Come, join me,” thereby allowing his going forth,

source: དགེ་སློང་ཚུར་ཤོག་ཚངས་པར་སྤྱད་པ་སྤྱོད་ཅིག་ཅེས་བཀའ་སྩལ་པ་དང་། །
en: and enjoined him with the words, “Monk, come, join me and live the holy life.”

source: དེ་བཅོམ་ལྡན་འདས་ཀྱི་བཀའི་མཇུག་ཁོ་ནར་སྐྲ་བྱི་བ་དང་སྣམ་སྦྱར་གྱོན་པར་གྱུར་ཏེ་
en: Only after the Blessed One had given his consent, did his hair fall out and was he clothed in robes,

source: སྐྲ་དང་ཁ་སྤུ་ཞག་བདུན་སྐྱེས་པ་ཙམ་དང་། ལག་པ་ན་ལྷུང་བཟེད་དང་བྱ་མ་བུམ་ཐོགས་ཤིང་དགེ་སློང་བསྙེན་པར་རྫོགས་ནས་
en: with but a week’s worth of hair and beard, alms bowl and water pitcher in hand. Having completed his approach to monkhood,

source: ལོ་བརྒྱ་ལོན་པའི་སྤྱོད་ལམ་ལྟ་བུར་གནས་པར་གྱུར་ཏོ།
en: he stood with the deportment of a monk who had been ordained for one hundred years.

source: ཡང་སྨྲས་པ། དེ་བཞིན་གཤེགས་པས་ཚུར་ཤོག་བཀའ་སྩལ་པས
en: Again it is said: “Once called by the Tathāgata to come forth,

source: སྐྲ་བྱི་སྣམ་སྦྱར་གྱོན་པའི་ལུས་ལྡན་ཞིང་། །མོད་ལ་དབང་པོ་རབ་ཞིར་གནས་གྱུར་ཏེ། །
en: Though your head be tonsured and your body clad in robes It is more important that your senses be stilled,

source: སངས་རྒྱས་དགོངས་པས་ལུས་གཟུགས་བཀབ་པར་གྱུར། །
en: For then will your body be swathed in the Buddha’s mind.”

source: དེ་དེ་ལྟར་རབ་ཏུ་བྱུང་ནས་གཅིག་པུ་དབེན་པ་བག་ཡོད་པ་རྟུན་པ་དང་ལྡན་པ་བདག་ཉིད་བཏང་བར་གནས་སོ། །
en: With this going forth, Dīrghanakha went to live alone in solitude, diligent and persevering, devoted to his resolve.

source: གཅིག་པུ་དབེན་པ་བག་ཡོད་པ་རྟུན་པ་དང་ལྡན་པ་བདག་ཉིད་བཏང་བར་གནས་པ་ན་
en: While living alone in solitude, diligent and persevering, devoted to his resolve,

source: རིགས་ཀྱི་བུ་གང་དག་གི་ཕྱིར་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་དག་བགོས་ནས་
en: he perceived that he had, in that very life, actualized the unsurpassed aim of the holy life for which the sons of noble families,

source: ཡང་དག་པ་ཁོ་ནར་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་འབྱུང་བར་བྱེད་པ་ཚངས་པར་སྤྱོད་པའི་མཐའ་བླ་ན་མེད་པ
en: with perfect faith, cut their hair, shave their beards, don the saffron robes, and go forth from home into homelessness.

source: དེ་ཚེ་དེ་ཉིད་ལ་རང་གི་མངོན་པར་ཤེས་པས་མངོན་སུམ་དུ་བྱས་ཏེ་བསྒྲུབས་ནས་བདག་གི་སྐྱེ་བ་ཟད་དོ། །ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ།
en: With his achievement, he understood, “My births have come to an end, I have lived the holy life,

source: བྱ་བ་བྱས་སོ། །སྲིད་པ་འདི་ལས་གཞན་མི་ཤེས་སོ་ཞེས་
en: I have done what needed doing, I will know no lives after this one.”

source: གོ་བར་བྱེད་ཅིང་ཚེ་དང་ལྡན་པ་དེ་ཀུན་ཤེས་པ་དང་ལྡན་པའི་དགྲ་བཅོམ་པ་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ།། །
en: Thus the venerable one achieved the all-knowing state of an arhat whose mind had been utterly freed.

source: །བར་སྡོམ་ལ།
en: A section index:

source: བདག་ནི་ཐམས་ཅད་མི་བཟོད་དང་། །འོ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་ཤེས། །
en: “All selves do not endure”; “You who view things thus,

source: ཁྱོད་ནི་སྐྱེ་བོ་ཕལ་ཆེན་མཚུངས། །འཇིག་རྟེན་དགེ་སྦྱོང་བྲམ་ཟེ་དང་། །
en: You are just like them”; Worldly persons, ascetics, and brahmins,

source: ལྟ་བའི་གནས་ནི་གསུམ་པོ་དང་། །འཕགས་པའི་ཉན་ཐོས་ཐོས་ལྡན་དང་། །
en: And their three positions on the view; Informed noble disciples;

source: ལུས་དང་ཚོར་དང་ཚོར་གཞི་འགག །ཀུན་འབྱུང་ལ་སོགས་ཤེས་པ་དང་། །
en: Body, feelings, and the cessation of the basis for feelings; Understanding their origin and the like;

source: མྱ་ངན་འདས་དང་ལུས་སྲོག་མཐའ། །ལུས་ཞིག་སྲོག་ནི་ཡོངས་གཏུགས་དང་། །
en: Transcending misery, the most basic of body and life-force; Life ends unaccompanied,

source: སྡུག་བསྔལ་མཐའ་དང་མི་ལྡན་དང་། །ཤཱ་རིའི་བུ་ནི་ཐ་མ་ཡིན། །
en: With the perishing of the body, And the end of suffering; And, lastly, Śāriputra.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: The Blessed One said to the monks,

source: དགེ་སློང་དག་ངའི་ཉན་ཐོས་ཀྱི་དགེ་སློང་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ་རྣམས་ཀྱི་ནང་ན་འདི་ལྟ་སྟེ།
en: “Monks, among my monk disciples who have gained the knowledge of perfect discernment,

source: དགེ་སློང་སྟོད་རིངས་མཆོག་ཡིན་ནོ། །
en: the monk Koṣṭhila is supreme.”

source: དགེ་སློང་རྣམས་ཐེ་ཙོམ་སྐྱེས་ནས་ཐེ་ཙོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: In doubt, the monks went to him who severs all doubts, the Blessed Buddha, and asked,

source: བཙུན་པ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ལས་ཅི་ཞིག་བགྱིས་ན་
en: “Reverend, what is it that the venerable Śāriputra has done,

source: ལས་དེའི་རྣམ་པར་སྨིན་པས་ཤེས་རབ་རྣོ་བ་དང་། ཤེས་རབ་ཟབ་པ་དང་། ངེས་པར་འབྱེད་པའི་ཤེས་རབ་ཅན་དུ་གྱུར།
en: that the ripened fruit of that action has made his intellect sharper, finer, and more incisive?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་
en: “Monks,” replied the Blessed One,

source: ཤཱ་རིའི་བུ་ཉིད་ཀྱིས་ལས་ཚོགས་རྙེད་པ། རྐྱེན་ཡོངས་སུ་བསྒྱུར་བ།
en: “Śāriputra himself discovered the store of action, mastered conditions,

source: འོད་པ་བཞིན་དུ་ཉེ་བར་གནས་པ་གདོན་མི་ཟ་བར་འབྱུང་བར་འགྱུར་བ་དག་བྱས་ཤིང་བསགས་པས།
en: tended to them as one does an irrigation channel, and emerged without indecision.

source: ཤཱ་རིའི་བུ་ཉིད་ཀྱིས་ལས་བྱས་ཤིང་བསགས་པ་དག་གཞན་སུ་ཞིག་གིས་སོ་སོར་མྱོང་བར་འགྱུར།
en: As he himself acted and accumulated thus, no one else experiences the results of actions and accumulations as Śāriputra has done.

source: དགེ་སློང་དག་ལས་བྱས་ཤིང་བསགས་པ་དག་ནི་ཕྱི་རོལ་གྱི་སའི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར།
en: Monks, actions and accumulations do not ripen upon the outer elements.

source: ཆུའི་ཁམས་ལ་མི་འགྱུར། མེའི་ཁམས་ལ་མི་འགྱུར། རླུང་གི་ཁམས་ལ་མི་འགྱུར་གྱི།
en: They do not ripen upon the element of water, upon the element of fire, nor upon the element of wind.

source: འདི་ལྟར་ལས་དགེ་བ་དང་མི་དགེ་བ་བྱས་ཤིང་བསགས་པ་དག་ནི་
en: The virtuous and non-virtuous actions performed and accumulated

source: ཟིན་པའི་ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་དག་ལ་རྣམ་པར་སྨིན་པར་འགྱུར་ཏེ།
en: come to fruition upon the aggregates, elements, and seats of the senses of the one who performed them:

source: ལས་རྣམས་བསྐལ་པ་བརྒྱར་ཡང་ནི། །ཆུད་མི་ཟ་བའང་ཚོགས་དང་དུས། །རྙེད་ན་ལུས་ཅན་རྣམས་ལ་ནི། །འབྲས་བུ་དག་ཏུ་འགྱུར་བ་ཉིད། །
en: “Actions never waste away, Not even after one hundred eons. When the time and the conditions Are right, they alight upon embodied beings.

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་རི་བྲགས་ཤིག་ན་བྲམ་ཟེ་ཞིག་འདུག་པ་དེས་རིགས་མཉམ་པ་ལས་ཆུང་མ་བླངས་ནས་དེ་དེ་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད།
en: “Monks, long ago a brahmin who lived in a remote mountain range took a wife of equal caste and together they sported, made love, and indulged all their desires.

source: དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་དོ། །རྩེ་བར་བྱེད། དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པ་དེའི་བུ་བྱུང་ནས་དེས་དེའི་མིང་ཞིབ་མ་ཞེས་བྱ་བར་ བཏགས་སོ། །
en: From their sporting, lovemaking, and the indulging all of their desires, there came a boy whom they named Śūrpī.

source: ཡང་རྩེ་བར་བྱེད། དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་པ་དེའི་བུ་མོ་ཞིག་བྱུང་ནས་དེས་དེའི་མིང་ཞིབ་མ་མོ་ཞེས་བྱ་བར་བཏགས་སོ། །
en: Again, they sported, made love, and indulged all their desires, producing a girl, whom they named Sūkṣmā.

source: ཇི་ཙམ་དུས་གཞན་ཞིག་ན་དེ་གཉིས་ཀྱི་ཕ་བྲམ་ཟེ་དེ་ཆུང་མ་དང་བཅས་ཏེ་དུས་ལ་བབ་བོ། །
en: After a while, their brahmin father’s time came, as did his wife’s.

source: བྲམ་ཟེའི་ཁྱེའུ་ཞིབ་མ་དེ་ཡང་དབེན་པ་ལ་དགའ་བའི་ཕྱིར་སྲིང་མོ་ཁྲིད་ནས་དགོན་པའི་ནགས་སུ་སོང་སྟེ་འདུག་གོ། །
en: The young brahmin Śūrpī, because he loved solitude, took his sister to live in a remote forest.

source: གང་གི་ཚེ་བུ་མོ་ཞིབ་མ་མོ་ཆེན་མོར་གྱུར་པ་དེའི་ཚེ་ན་ཉོན་མོངས་པ་དག་གིས་གནོད་པར་གྱུར་ནས་དེས་སྨྲས་པ།
en: “At a certain point, his sister Sūkṣmā grew into a woman and at the time, beset by disturbing emotions, said,

source: མིང་པོ་བདག་ནི་དགོན་པའི་སྨན་དག་གིས་འཚོ་བར་མི་ནུས་ཀྱིས་བདག་ཅག་གྲོང་མཐར་འདོང་ངོ་། །
en: ‘Brother, I cannot be sustained by the medicinal plants in this forest. Let us go to the outskirts of town.’

source: དེས་སྲིང་མོ་ཁྲིད་དེ་གྲོང་མཐར་སོང་ནས་དེ་གཉིས་ཅིག་ཅར་ཁྱིམ་གཅིག་ཏུ་སློང་མོ་ལ་ཞུགས་པ་དང་
en: “So Śūrpī took his sister to the outskirts of town, and as they approached a house to beg alms,

source: བྲམ་ཟེ་ནང་ན་འདུག་པས་བུད་མེད་དང་སྐྱེས་པའི་ཚིག་བརྗོད་པ་ཐོས་སོ། །
en: a brahmin sitting in his home heard the voice of a man speaking to a woman.

source: ཐོས་ནས་དེ་ཕྱིར་བྱུང་སྟེ་སྨྲས་པ།
en: On hearing this, the brahmin came out and asked,

source: ཅི་དྲང་སྲོང་ཡང་ཆུང་མ་དང་ལྷན་ཅིག་ཡོངས་སུ་རྒྱུའམ།
en: ‘What is a sage doing traveling with a wife?’

source: དེས་སྨྲས་པ། འདི་ནི་ཁོ་བོའི་ཆུང་མ་མ་ཡིན་གྱི། འདི་ནི་ཁོ་བོའི་སྲིང་མོ་ཡིན་ནོ། །
en: ‘This is not my wife. This is my younger sister.

source: ཅི་འགའ་ཞིག་ལ་བྱིན་ནམ།
en: Would you give us a little something to eat?’

source: དེས་སྨྲས་པ། མ་བྱིན་ནོ། །གལ་ཏེ་མ་བྱིན་ན་འདི་ཁོ་བོའི་ཆུང་མར་བྱིན་ཅིག །
en: ‘I will not. And if I refuse, would you give me your sister?’

source: དེས་སྨྲས་པ། འདིས་ནི་སྡིག་པ་ཅན་དམ་པ་མ་ཡིན་པའི་ཆོས་དེ་སྤངས་སོ། །
en: ‘That would be a sin and I reject such ignoble principles.’

source: ཞིབ་མ་མོས་སྨྲས་པ། མིང་པོ་བདག་ནི་དགོན་པའི་སྨན་དག་གིས་འཚོ་བར་མི་ནུས་ཀྱིས་བདག་ཅག་གྲོང་མཐར་འདོང་ངོ་ཞེས་སྨྲས་པ།
en: “Sūkṣmā said, ‘Brother, the medicinal plants in this forest do not sustain me, so it was I who suggested we go to the edge of town.

source: དེ་ཇི་སྙམ་དུ་སེམས། འདི་ལྟར་བདག་ནི་ཉོན་མོངས་པ་དག་གིས་གནོད་པར་གྱུར་ཏོ།
en: Why did I suggest it? Incapacitated as I am by emotions, I trusted you would know what to do.’

source: དེ་ཇི་སྙམ་དུ་སེམས། འདི་ལྟར་བདག་ནི་ཉོན་མོངས་པ་དག་གིས་གནོད་པར་གྱུར་ཏོ། །
en: Why did I suggest it? Incapacitated as I am by emotions, I trusted you would know what to do.’ “
